
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = "Сведения об обработке";
	УстановитьВерсиюОбработки();
	ПроверитьАктуальностьВерсии();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияНомерВерсииНажатие(Элемент)
	
	Попытка
		ЗапуститьПриложениеАсинх(СтрШаблон("https://github.com/alei1180/clockifytobitrix24/releases/tag/ver%1", Версия));
	Исключение	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияСостояниеНажатие(Элемент)
	
	Попытка
		ЗапуститьПриложениеАсинх(СтрШаблон("https://github.com/alei1180/clockifytobitrix24/releases/tag/ver%1", НомерАктуальнойВерсии));
	Исключение	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаАвтораРазработкиНажатие(Элемент)
	
	Попытка
		ЗапуститьПриложениеАсинх("https://github.com/alei1180/");
	Исключение	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАдресПроектаGitHubНажатие(Элемент) 
	
	Попытка	
		ЗапуститьПриложениеАсинх("https://github.com/alei1180/clockifytobitrix24/");
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВерсиюОбработки()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Версия = ОбработкаОбъект.ПолучитьВерсиюПроекта();
	Элементы.ДекорацияНомерВерсии.Заголовок = Версия;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктуальностьВерсии()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	НомерАктуальнойВерсии = Версия;
	Попытка
		НомерАктуальнойВерсии = ОбработкаОбъект.GitHub_ПолучитьНомерПоследнейВерсии();
	Исключение
	КонецПопытки;
	
	Элементы.ВерсияСостояние.Видимость = НЕ Версия = НомерАктуальнойВерсии;
	
КонецПроцедуры

#КонецОбласти

